    Core Python
    Data Transformation / Data Manipulation
        Numpy => Numeric Python
        Pandas =>

    Structured
        Series
        Dataframe
        JSON
        XML
        CSV
    unstructured
        Video
        Audio
        File
    Semi structured
        PDF

In [1]:
! pip install pandas

Requirement already satisfied: pandas in c:\users\starl\appdata\local\programs\python\python312\lib\site-packages (2.1.4)
Requirement already satisfied: numpy<2,>=1.26.0 in c:\users\starl\appdata\local\programs\python\python312\lib\site-packages (from pandas) (1.26.2)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\starl\appdata\roaming\python\python312\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\starl\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2023.3.post1)
Requirement already satisfied: tzdata>=2022.1 in c:\users\starl\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in c:\users\starl\appdata\roaming\python\python312\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [2]:
import pandas as pd

In [3]:
pd.__version__

'2.1.4'

    Python 
        3.12.1
            2.1.4
            1.5.3
            2.2.0
        py -m pip install pandas==2.2.0
        3.9.2
            1.5.3

In [4]:
ser=pd.Series([1,2,3])
ser

0    1
1    2
2    3
dtype: int64

In [6]:
ser1=pd.Series((5.0,6,7,8,9))
ser1

0    5.0
1    6.0
2    7.0
3    8.0
4    9.0
dtype: float64

In [7]:
import numpy as np

In [11]:
ser2=pd.Series(np.arange(15,69,10),name='Marks')
ser2

0    15
1    25
2    35
3    45
4    55
5    65
Name: Marks, dtype: int32

In [13]:
ser3=pd.Series(np.arange(15,69,10),name='Marks',index=[1,2,3,4,5,6])
ser3

1    15
2    25
3    35
4    45
5    55
6    65
Name: Marks, dtype: int32

In [14]:
ser3=pd.Series(np.arange(15,69,10),name='Marks',index=['a','b','c','d','e','f'])
ser3

a    15
b    25
c    35
d    45
e    55
f    65
Name: Marks, dtype: int32

In [15]:
ser3=pd.Series(np.arange(15,69,10),name='Marks',index=('a','b','c','d','e','f'))
ser3

a    15
b    25
c    35
d    45
e    55
f    65
Name: Marks, dtype: int32

In [16]:
ser3=pd.Series(np.arange(15,69,10),name='Marks',index='abcdef')
ser3

TypeError: Index(...) must be called with a collection of some kind, 'abcdef' was passed

In [18]:
population_dict = {
    'California':38956785,
    'Texas':26441568,
    'New York':19555647,
    'Florida':12364569,
    'Illinois':12882135
}

population_dict

{'California': 38956785,
 'Texas': 26441568,
 'New York': 19555647,
 'Florida': 12364569,
 'Illinois': 12882135}

In [20]:
ser_pop=pd.Series(population_dict,name='population_value')
ser_pop

California    38956785
Texas         26441568
New York      19555647
Florida       12364569
Illinois      12882135
Name: population_value, dtype: int64

    ndim
    size
    shape
    dtype

In [23]:
ser_pop.dtype

dtype('int64')

In [24]:
ser_pop.size

5

In [21]:
ser_pop.ndim

1

In [22]:
ser_pop.shape

(5,)

In [26]:
ser_pop['California']

38956785

In [27]:
ser_pop['Texas']

26441568

In [28]:
ser_pop

California    38956785
Texas         26441568
New York      19555647
Florida       12364569
Illinois      12882135
Name: population_value, dtype: int64

In [29]:
ser_pop['California':'Texas']

California    38956785
Texas         26441568
Name: population_value, dtype: int64

In [30]:
ser_pop['California':'New York']

California    38956785
Texas         26441568
New York      19555647
Name: population_value, dtype: int64

In [33]:
ser_pop['California':'Florida':2]

California    38956785
New York      19555647
Name: population_value, dtype: int64

    variable_name[start_index:end_index:step]

In [35]:
ser_pop[::]

California    38956785
Texas         26441568
New York      19555647
Florida       12364569
Illinois      12882135
Name: population_value, dtype: int64

In [38]:
ser_pop[::-1]

Illinois      12882135
Florida       12364569
New York      19555647
Texas         26441568
California    38956785
Name: population_value, dtype: int64

In [36]:
ser_pop[-1]

C:\Users\starl\AppData\Local\Temp\ipykernel_9800\966182546.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  ser_pop[-1]

12882135

In [39]:
type(ser_pop)

pandas.core.series.Series

    Creating Dataframe

In [40]:
[i for i in range(5,51,5)]

[5, 10, 15, 20, 25, 30, 35, 40, 45, 50]

In [41]:
pd.DataFrame([i for i in range(5,51,5)])

    0
0   5
1  10
2  15
3  20
4  25
5  30
6  35
7  40
8  45
9  50

In [42]:
pd.DataFrame(tuple([i for i in range(5,51,5)]))

    0
0   5
1  10
2  15
3  20
4  25
5  30
6  35
7  40
8  45
9  50

In [45]:
pd.DataFrame(tuple([i for i in range(5,51,5)]),columns=['marks'])

   marks
0      5
1     10
2     15
3     20
4     25
5     30
6     35
7     40
8     45
9     50

In [49]:
pd.DataFrame(
    tuple([i for i in range(5,51,5)]),
    columns=['marks'],
    index=[i for i in range(10,101,10)]
)

     marks
10       5
20      10
30      15
40      20
50      25
60      30
70      35
80      40
90      45
100     50

In [50]:
ser=pd.Series([i for i in range(10,101,10)],name='Marks')
ser

0     10
1     20
2     30
3     40
4     50
5     60
6     70
7     80
8     90
9    100
Name: Marks, dtype: int64

In [51]:
pd.DataFrame(ser)

   Marks
0     10
1     20
2     30
3     40
4     50
5     60
6     70
7     80
8     90
9    100

    If we are creating dataframe using Series which have name resulted dataframe will have same name for columns

    However if we are using list tuple numpy array we will get column name as 
        0... len-1
        and we will have to use 
        columns parameter to assign the name

In [52]:
population_dict = {
    'California':38956785,
    'Texas':26441568,
    'New York':19555647,
    'Florida':12364569,
    'Illinois':12882135
}

In [60]:
pd.DataFrame(population_dict,index=['population'])

            California     Texas  New York   Florida  Illinois
population    38956785  26441568  19555647  12364569  12882135

In [75]:
dc={
    'col1':['a','b','c'],
    'col2':('d','e','f'),
    'col3':['g','h','i'],
    'c1':('e','f','a')
}

In [81]:
df=pd.DataFrame(
    dc,
    index=['row1','row2','row3']
    )
df

     col1 col2 col3 c1
row1    a    d    g  e
row2    b    e    h  f
row3    c    f    i  a

In [87]:
df['col1'].dtype

dtype('O')

In [88]:
df.dtypes

col1    object
col2    object
col3    object
c1      object
dtype: object

    ndim
    dtype
    dtypes
    shape
    size

In [82]:
df.shape

(3, 4)

In [84]:
df.size

12

In [83]:
df.ndim

2

In [89]:
df.columns

Index(['col1', 'col2', 'col3', 'c1'], dtype='object')

In [90]:
df.index

Index(['row1', 'row2', 'row3'], dtype='object')

    Dataframe
        ndim
        shape
        size
        dtype => columnwise
        dtypes
        columns
        index

In [91]:
dir(pd)

['ArrowDtype',
 'BooleanDtype',
 'Categorical',
 'CategoricalDtype',
 'CategoricalIndex',
 'DataFrame',
 'DateOffset',
 'DatetimeIndex',
 'DatetimeTZDtype',
 'ExcelFile',
 'ExcelWriter',
 'Flags',
 'Float32Dtype',
 'Float64Dtype',
 'Grouper',
 'HDFStore',
 'Index',
 'IndexSlice',
 'Int16Dtype',
 'Int32Dtype',
 'Int64Dtype',
 'Int8Dtype',
 'Interval',
 'IntervalDtype',
 'IntervalIndex',
 'MultiIndex',
 'NA',
 'NaT',
 'NamedAgg',
 'Period',
 'PeriodDtype',
 'PeriodIndex',
 'RangeIndex',
 'Series',
 'SparseDtype',
 'StringDtype',
 'Timedelta',
 'TimedeltaIndex',
 'Timestamp',
 'UInt16Dtype',
 'UInt32Dtype',
 'UInt64Dtype',
 'UInt8Dtype',
 '__all__',
 '__builtins__',
 '__cached__',
 '__doc__',
 '__docformat__',
 '__file__',
 '__git_version__',
 '__loader__',
 '__name__',
 '__package__',
 '__path__',
 '__spec__',
 '__version__',
 '_built_with_meson',
 '_config',
 '_is_numpy_dev',
 '_libs',
 '_pandas_datetime_CAPI',
 '_pandas_parser_CAPI',
 '_testing',
 '_typing',
 '_version_meson',
 'annotations',
 'api',
 'array',
 'arrays',
 'bdate_range',
 'compat',
 'concat',
 'core',
 'crosstab',
 'cut',
 'date_range',
 'describe_option',
 'errors',
 'eval',
 'factorize',
 'from_dummies',
 'get_dummies',
 'get_option',
 'infer_freq',
 'interval_range',
 'io',
 'isna',
 'isnull',
 'json_normalize',
 'lreshape',
 'melt',
 'merge',
 'merge_asof',
 'merge_ordered',
 'notna',
 'notnull',
 'offsets',
 'option_context',
 'options',
 'pandas',
 'period_range',
 'pivot',
 'pivot_table',
 'plotting',
 'qcut',
 'read_clipboard',
 'read_csv',
 'read_excel',
 'read_feather',
 'read_fwf',
 'read_gbq',
 'read_hdf',
 'read_html',
 'read_json',
 'read_orc',
 'read_parquet',
 'read_pickle',
 'read_sas',
 'read_spss',
 'read_sql',
 'read_sql_query',
 'read_sql_table',
 'read_stata',
 'read_table',
 'read_xml',
 'reset_option',
 'set_eng_float_format',
 'set_option',
 'show_versions',
 'test',
 'testing',
 'timedelta_range',
 'to_datetime',
 'to_numeric',
 'to_pickle',
 'to_timedelta',
 'tseries',
 'unique',
 'util',
 'value_counts',
 'wide_to_long']

In [94]:
import pandas as pd
import numpy as np

    Path => URL Link

In [93]:
df_big_mart=pd.read_csv('https://raw.githubusercontent.com/starlordali4444/acciojob_python/main/da4/data/csv/bigmart_data.csv')

    Data Analysis Life Cycle
        Getting Data / Data Ingestion
            read_csv            
                Path
                    URL Link
                    Absolute Path
                    Relative Path
            read_excel
            read_sql
        Understanding the data
            Sample
                head => top 5 row by default
                tail => bottom 5 row by default
                sample => will return random row by default
            Data Check
                ndim
                shape
                size
                dtypes
                columns
                index
                info()
                    type
                    index
                    columns
                    how many non null values 
                    datatypes of each columns
                    how much memory we are using for dataframe

In [129]:
df_big_mart.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8523 entries, 0 to 8522
Data columns (total 12 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   Item_Identifier            8523 non-null   object
 1   Item_Weight                7060 non-null   float64
 2   Item_Fat_Content           8523 non-null   object
 3   Item_Visibility            8523 non-null   float64
 4   Item_Type                  8523 non-null   object
 5   Item_MRP                   8523 non-null   float64
 6   Outlet_Identifier          8523 non-null   object
 7   Outlet_Establishment_Year  8523 non-null   int64
 8   Outlet_Size                6113 non-null   object
 9   Outlet_Location_Type       8523 non-null   object
 10  Outlet_Type                8523 non-null   object
 11  Item_Outlet_Sales          8523 non-null   float64
dtypes: float64(4), int64(1), object(7)
memory usage: 799.2+ KB

In [128]:
df_big_mart.dtypes # will return ther datatypes of each columsn of the dataframe

Item_Identifier               object
Item_Weight                  float64
Item_Fat_Content              object
Item_Visibility              float64
Item_Type                     object
Item_MRP                     float64
Outlet_Identifier             object
Outlet_Establishment_Year      int64
Outlet_Size                   object
Outlet_Location_Type          object
Outlet_Type                   object
Item_Outlet_Sales            float64
dtype: object

In [125]:
df_big_mart.shape # we are getting 8523 rows and 12 columns

(8523, 12)

In [126]:
df_big_mart.columns  # list of all the columns in the dataframe

Index(['Item_Identifier', 'Item_Weight', 'Item_Fat_Content', 'Item_Visibility',
       'Item_Type', 'Item_MRP', 'Outlet_Identifier',
       'Outlet_Establishment_Year', 'Outlet_Size', 'Outlet_Location_Type',
       'Outlet_Type', 'Item_Outlet_Sales'],
      dtype='object')

In [127]:
df_big_mart.index # Will give index related information

RangeIndex(start=0, stop=8523, step=1)

In [124]:
df_big_mart.ndim

2

In [123]:
df_big_mart.sample(3)

,Item_Identifier,Item_Weight,Item_Fat_Content,Item_Visibility,Item_Type,Item_MRP,Outlet_Identifier,Outlet_Establishment_Year,Outlet_Size,Outlet_Location_Type,Outlet_Type,Item_Outlet_Sales
3796,DRD37,9.80,Low Fat,0.013830,Soft Drinks,45.3060,OUT013,1987,High,Tier 3,Supermarket Type1,1304.9680
2022,DRH36,16.20,Low Fat,0.000000,Soft Drinks,73.4696,OUT013,1987,High,Tier 3,Supermarket Type1,2087.9488
3873,FDU56,16.85,LF,0.044414,Fruits and Vegetables,182.4266,OUT046,1997,Small,Tier 1,Supermarket Type1,2028.6926

In [97]:
df_big_mart.head(3)

,Item_Identifier,Item_Weight,Item_Fat_Content,Item_Visibility,Item_Type,Item_MRP,Outlet_Identifier,Outlet_Establishment_Year,Outlet_Size,Outlet_Location_Type,Outlet_Type,Item_Outlet_Sales
0,FDA15,9.30,Low Fat,0.016047,Dairy,249.8092,OUT049,1999,Medium,Tier 1,Supermarket Type1,3735.1380
1,DRC01,5.92,Regular,0.019278,Soft Drinks,48.2692,OUT018,2009,Medium,Tier 3,Supermarket Type2,443.4228
2,FDN15,17.50,Low Fat,0.016760,Meat,141.6180,OUT049,1999,Medium,Tier 1,Supermarket Type1,2097.2700

In [96]:
df_big_mart.tail()

,Item_Identifier,Item_Weight,Item_Fat_Content,Item_Visibility,Item_Type,Item_MRP,Outlet_Identifier,Outlet_Establishment_Year,Outlet_Size,Outlet_Location_Type,Outlet_Type,Item_Outlet_Sales
8518,FDF22,6.865,Low Fat,0.056783,Snack Foods,214.5218,OUT013,1987,High,Tier 3,Supermarket Type1,2778.3834
8519,FDS36,8.380,Regular,0.046982,Baking Goods,108.1570,OUT045,2002,NaN,Tier 2,Supermarket Type1,549.2850
8520,NCJ29,10.600,Low Fat,0.035186,Health and Hygiene,85.1224,OUT035,2004,Small,Tier 2,Supermarket Type1,1193.1136
8521,FDN46,7.210,Regular,0.145221,Snack Foods,103.1332,OUT018,2009,Medium,Tier 3,Supermarket Type2,1845.5976
8522,DRG01,14.800,Low Fat,0.044878,Soft Drinks,75.4670,OUT046,1997,Small,Tier 1,Supermarket Type1,765.6700

In [95]:
df_big_mart.head()

,Item_Identifier,Item_Weight,Item_Fat_Content,Item_Visibility,Item_Type,Item_MRP,Outlet_Identifier,Outlet_Establishment_Year,Outlet_Size,Outlet_Location_Type,Outlet_Type,Item_Outlet_Sales
0,FDA15,9.30,Low Fat,0.016047,Dairy,249.8092,OUT049,1999,Medium,Tier 1,Supermarket Type1,3735.1380
1,DRC01,5.92,Regular,0.019278,Soft Drinks,48.2692,OUT018,2009,Medium,Tier 3,Supermarket Type2,443.4228
2,FDN15,17.50,Low Fat,0.016760,Meat,141.6180,OUT049,1999,Medium,Tier 1,Supermarket Type1,2097.2700
3,FDX07,19.20,Regular,0.000000,Fruits and Vegetables,182.0950,OUT010,1998,NaN,Tier 3,Grocery Store,732.3800
4,NCD19,8.93,Low Fat,0.000000,Household,53.8614,OUT013,1987,High,Tier 3,Supermarket Type1,994.7052

    Path => Absolute Path

In [131]:
df_big_mart=pd.read_csv(r'A:\work\acciojob\python\batches\da4\data\csv\bigmart_data.csv')

In [132]:
df_big_mart.head()

,Item_Identifier,Item_Weight,Item_Fat_Content,Item_Visibility,Item_Type,Item_MRP,Outlet_Identifier,Outlet_Establishment_Year,Outlet_Size,Outlet_Location_Type,Outlet_Type,Item_Outlet_Sales
0,FDA15,9.30,Low Fat,0.016047,Dairy,249.8092,OUT049,1999,Medium,Tier 1,Supermarket Type1,3735.1380
1,DRC01,5.92,Regular,0.019278,Soft Drinks,48.2692,OUT018,2009,Medium,Tier 3,Supermarket Type2,443.4228
2,FDN15,17.50,Low Fat,0.016760,Meat,141.6180,OUT049,1999,Medium,Tier 1,Supermarket Type1,2097.2700
3,FDX07,19.20,Regular,0.000000,Fruits and Vegetables,182.0950,OUT010,1998,NaN,Tier 3,Grocery Store,732.3800
4,NCD19,8.93,Low Fat,0.000000,Household,53.8614,OUT013,1987,High,Tier 3,Supermarket Type1,994.7052

    Path => Relative path

In [133]:
df_big_mart=pd.read_csv('../data/csv/bigmart_data.csv')

In [134]:
df_score=pd.read_csv('../data/csv/student_records.csv')

In [135]:
df_score.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Name           10 non-null     object
 1   OverallGrade   9 non-null      object
 2   Obedient       10 non-null     object
 3   ResearchScore  10 non-null     int64
 4   ProjectScore   10 non-null     int64
 5   Recommend      10 non-null     object
dtypes: int64(2), object(4)
memory usage: 612.0+ bytes

In [136]:
df_score.head()

     Name OverallGrade Obedient  ResearchScore  ProjectScore Recommend
0   Henry            A        Y             90            85       Yes
1    John            C        N             85            51       Yes
2   David            F        N             10            17        No
3  Holmes            B        Y             75            71        No
4  Marvin            E        N             20            30        No

    Slicing

In [137]:
df_score['Name']

0     Henry
1      John
2     David
3    Holmes
4    Marvin
5     Simon
6    Robert
7     Trent
8      Judy
9     Chris
Name: Name, dtype: object

In [140]:
df_score[['Name','ProjectScore','ResearchScore']]

     Name  ProjectScore  ResearchScore
0   Henry            85             90
1    John            51             85
2   David            17             10
3  Holmes            71             75
4  Marvin            30             20
5   Simon            79             92
6  Robert            59             60
7   Trent            65             75
8    Judy            33             25
9   Chris            15             25

    loc
        df_name.loc[rows_start_label:row_end_label:row_step,col_start:col_end:col_step]
        df_name.loc[[list_of_index],[list_of_columns]]

    iloc

In [152]:
df_score.head()

     Name OverallGrade Obedient  ResearchScore  ProjectScore Recommend
0   Henry            A        Y             90            85       Yes
1    John            C        N             85            51       Yes
2   David            F        N             10            17        No
3  Holmes            B        Y             75            71        No
4  Marvin            E        N             20            30        No

In [157]:
df_score.head() # head() fucntion is used to print top 5 records only

     Name OverallGrade Obedient  ResearchScore  ProjectScore Recommend
0   Henry            A        Y             90            85       Yes
1    John            C        N             85            51       Yes
2   David            F        N             10            17        No
3  Holmes            B        Y             75            71        No
4  Marvin            E        N             20            30        No

In [153]:
df_score.loc[:,:]

     Name OverallGrade Obedient  ResearchScore  ProjectScore Recommend
0   Henry            A        Y             90            85       Yes
1    John            C        N             85            51       Yes
2   David            F        N             10            17        No
3  Holmes            B        Y             75            71        No
4  Marvin            E        N             20            30        No
5   Simon            A        Y             92            79       Yes
6  Robert            B        Y             60            59        No
7   Trent            C        Y             75            65        No
8    Judy          NaN        Y             25            33        No
9   Chris            D        U             25            15        NO

In [160]:
df_score.loc[0:8,['Name','ResearchScore']]

     Name  ResearchScore
0   Henry             90
1    John             85
2   David             10
3  Holmes             75
4  Marvin             20
5   Simon             92
6  Robert             60
7   Trent             75
8    Judy             25

In [166]:
df_score=pd.read_csv('../data/csv/student_records.csv',index_col=['Name'])
df_score

       OverallGrade Obedient  ResearchScore  ProjectScore Recommend
Name
Henry             A        Y             90            85       Yes
John              C        N             85            51       Yes
David             F        N             10            17        No
Holmes            B        Y             75            71        No
Marvin            E        N             20            30        No
Simon             A        Y             92            79       Yes
Robert            B        Y             60            59        No
Trent             C        Y             75            65        No
Judy            NaN        Y             25            33        No
Chris             D        U             25            15        NO

    df_name.loc[rows_start_label:row_end_label:row_step,col_start:col_end:col_step]

In [171]:
df_score

       OverallGrade Obedient  ResearchScore  ProjectScore Recommend
Name
Henry             A        Y             90            85       Yes
John              C        N             85            51       Yes
David             F        N             10            17        No
Holmes            B        Y             75            71        No
Marvin            E        N             20            30        No
Simon             A        Y             92            79       Yes
Robert            B        Y             60            59        No
Trent             C        Y             75            65        No
Judy            NaN        Y             25            33        No
Chris             D        U             25            15        NO

In [191]:
df_score.loc[['Henry'],['OverallGrade']]

      OverallGrade
Name
Henry            A

In [178]:
df_score.loc[::2]

       OverallGrade Obedient  ResearchScore  ProjectScore Recommend
Name
Henry             A        Y             90            85       Yes
David             F        N             10            17        No
Marvin            E        N             20            30        No
Robert            B        Y             60            59        No
Judy            NaN        Y             25            33        No

In [179]:
df_score.loc[::2,::2]

       OverallGrade  ResearchScore Recommend
Name
Henry             A             90       Yes
David             F             10        No
Marvin            E             20        No
Robert            B             60        No
Judy            NaN             25        No

In [182]:
df_score.loc[::2,:'ProjectScore':]

       OverallGrade Obedient  ResearchScore  ProjectScore
Name
Henry             A        Y             90            85
David             F        N             10            17
Marvin            E        N             20            30
Robert            B        Y             60            59
Judy            NaN        Y             25            33

    df_name.loc[[list_of_index],[list_of_columns]]

In [187]:
df_score.loc[['Henry','Robert'],['OverallGrade','ProjectScore']]

       OverallGrade  ProjectScore
Name
Henry             A            85
Robert            B            59

In [183]:
df_score.iloc[:,:]

       OverallGrade Obedient  ResearchScore  ProjectScore Recommend
Name
Henry             A        Y             90            85       Yes
John              C        N             85            51       Yes
David             F        N             10            17        No
Holmes            B        Y             75            71        No
Marvin            E        N             20            30        No
Simon             A        Y             92            79       Yes
Robert            B        Y             60            59        No
Trent             C        Y             75            65        No
Judy            NaN        Y             25            33        No
Chris             D        U             25            15        NO

In [184]:
df_score.iloc[:5,:]

       OverallGrade Obedient  ResearchScore  ProjectScore Recommend
Name
Henry             A        Y             90            85       Yes
John              C        N             85            51       Yes
David             F        N             10            17        No
Holmes            B        Y             75            71        No
Marvin            E        N             20            30        No

In [185]:
df_score.iloc[:5,:3]

       OverallGrade Obedient  ResearchScore
Name
Henry             A        Y             90
John              C        N             85
David             F        N             10
Holmes            B        Y             75
Marvin            E        N             20

    We need all those students whom are recommended by Coach

In [192]:
df_score

       OverallGrade Obedient  ResearchScore  ProjectScore Recommend
Name
Henry             A        Y             90            85       Yes
John              C        N             85            51       Yes
David             F        N             10            17        No
Holmes            B        Y             75            71        No
Marvin            E        N             20            30        No
Simon             A        Y             92            79       Yes
Robert            B        Y             60            59        No
Trent             C        Y             75            65        No
Judy            NaN        Y             25            33        No
Chris             D        U             25            15        NO

In [213]:
df_score[df_score.loc[:,'Recommend']=='Yes']

      OverallGrade Obedient  ResearchScore  ProjectScore Recommend
Name
Henry            A        Y             90            85       Yes
John             C        N             85            51       Yes
Simon            A        Y             92            79       Yes

In [200]:
cond_recommend=df_score['Recommend']=='Yes'

In [206]:
df_score['Recommend']=='Yes'

Name
Henry      True
John       True
David     False
Holmes    False
Marvin    False
Simon      True
Robert    False
Trent     False
Judy      False
Chris     False
Name: Recommend, dtype: bool

In [202]:
df_score[cond_recommend]

      OverallGrade Obedient  ResearchScore  ProjectScore Recommend
Name
Henry            A        Y             90            85       Yes
John             C        N             85            51       Yes
Simon            A        Y             92            79       Yes

In [199]:
df_score[cond_recommend]

       OverallGrade Obedient  ResearchScore  ProjectScore Recommend
Name
Henry           NaN      NaN            NaN           NaN       Yes
John            NaN      NaN            NaN           NaN       Yes
David           NaN      NaN            NaN           NaN       NaN
Holmes          NaN      NaN            NaN           NaN       NaN
Marvin          NaN      NaN            NaN           NaN       NaN
Simon           NaN      NaN            NaN           NaN       Yes
Robert          NaN      NaN            NaN           NaN       NaN
Trent           NaN      NaN            NaN           NaN       NaN
Judy            NaN      NaN            NaN           NaN       NaN
Chris           NaN      NaN            NaN           NaN       NaN

    Data Exploration
    Data Manupulation/transformation
        Arithmatic
        Statistical
        Joins
        Union
        Groupy
        Value_counts